# Задача 3
# Имеются данные о количестве полных лет трёх призёров спартакиады.
# Напишите программу, выбирающую и выводящую возраст самого младшего призёра.

ages = [11, 12, 10]

print('Возраст самого младшего призёра:\n', min(ages))